Autodesk.Revit.DB.Mesh.ComputeCentroid
Computes and returns the centroid of the mesh, if it is topologically closed and its volume is not zero.
The centroid corresponds to the center of mass of the mesh, if its interior were
filled by a material of uniform density.
Returns:
XYZ value representing the position of the center of mass.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The mesh is not topologically closed, or has zero volume.
Check Mesh.IsClosed to determine if the mesh is closed.
Since:
2024

Autodesk.Revit.DB.Mesh.ComputeVolume
Computes and returns the volume enclosed by the mesh, if it is topologically closed.
Returns:
A double, representing the volume.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The mesh is not topologically closed. Check Mesh.IsClosed to determine if the mesh is closed.
Since:
2024

Autodesk.Revit.DB.Mesh.ComputeSurfaceArea
Computes and returns the surface area of the mesh. The surface area is the sum of the areas of the
constituent facets of the mesh.
Returns:
A double, representing the surface area.
Since:
2024

Autodesk.Revit.DB.Mesh.GetNormals
Returns all normals assigned to the mesh.
Returns:
An array of XYZ values, each representing a normal unit vector.
Since:
2021

Autodesk.Revit.DB.Mesh.GetNormal(System.Int32)
Returns a normal unit vector at the given index.
idx:
A zero-based index. It must be consistent with the DistributionOfNormals.
Returns:
XYZ value representing a normal unit vector.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given value is not a valid index of a normal of the mesh.
A valid value is not negative and is smaller than the number of normals in the mesh.
Since:
2021

Autodesk.Revit.DB.Mesh.IsClosed
Indicates whether the mesh is closed.
Remarks:
Every time this property is accessed, it is computed from scratch,
so accessing it multiple times will come at a performance cost.
A mesh is closed when each of its edges has two (or more) faces.
If an edge has more than two faces (meaning that it's a non-manifold edge),
the mesh still may be closed.
Since:
2022

Autodesk.Revit.DB.Mesh.DistributionOfNormals
Indicates the distribution of normal vectors along the tessellated mesh surface.
Since:
2021

Autodesk.Revit.DB.Mesh.NumberOfNormals
The number of normals associated with the mesh.
Remarks:
The number is always equal either to '1', or the number of facets,
or the number of points. The DistributionOfNormals property indicates
how normals are distributed along the polymesh. If there is only one normal available,
it applies to the entire mesh. Curved surfaces have normal vectors associated
with either every facet or every point/vertex of the tessellated  polymesh.
Since:
2021